Repository: giellalt/corpus-fin
Catalog: tmx/smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=302_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: Yhteystiedot
smn: Ohtâvuotâ

source: Saamelaiskulttuurikeskus Sajos
smn: Sajos

source: Tilavaraukset ja markkinointi
smn: Av-teknikko Janne Lappalainen

source: Toimitilahuolto / Vahtimestari
smn: Laitoshuoltaja Pirkko Pieski

source: Toimitilahuoltaja Pauli Saijets
smn: Toimistosihteeri Ritva Tammela
